БИТУправление_медицинским_центром_демо/src/Documents/ЗаказВоВнешнююЛабораторию/ЗаказВоВнешнююЛабораторию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗаказВоВнешнююЛабораторию</name>
  <posting>Deny</posting>
  <registerRecords>InformationRegister.ЛабораторныеИсследования</registerRecords>
  <attributes>
    <name>Филиал</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </attributes>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Состояние</name>
    <type>
      <types>EnumRef.СостоянияЗаказовЛаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>удалитьРезультат</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </attributes>
  <attributes>
    <name>Анонимно</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаказаВнешнейЛаборатории</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Исследования</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>128</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ИД</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>Состояние</name>
      <type>
        <types>EnumRef.СостоянияЗаказовЛаборатории</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Результаты</name>
    <attributes>
      <name>КодПробы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>16</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БИТУправление_медицинским_центром_демо/src/InformationRegisters/ЛабораторныеИсследования/ЛабораторныеИсследования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ЛабораторныеИсследования</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>КлиникаИсходная</name>
    <type>
      <types>CatalogRef.Филиалы</types>
    </type>
  </resources>
  <resources>
    <name>Местонахождение</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Филиалы</types>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </resources>
  <resources>
    <name>КодПробы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Клиенты</types>
    </type>
  </resources>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СостоянияИсследований</types>
    </type>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </resources>
  <resources>
    <name>Лаборатория</name>
    <comment>БИТ.Титова ЛТ 2</comment>
    <type>
      <types>CatalogRef.Лаборатории</types>
    </type>
  </resources>
  <resources>
    <name>Анонимно</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПорядковыйНомер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ИД</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияЗаказовЛаборатории/СостоянияЗаказовЛаборатории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияЗаказовЛаборатории</name>
  <enumValues>
    <name>Создан</name>
  </enumValues>
  <enumValues>
    <name>Отправлен</name>
  </enumValues>
  <enumValues>
    <name>ПолученРезультат</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Enums/СостоянияИсследований/СостоянияИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СостоянияИсследований</name>
  <enumValues>
    <name>Назначен</name>
  </enumValues>
  <enumValues>
    <name>Забран</name>
  </enumValues>
  <enumValues>
    <name>Проанализирован</name>
  </enumValues>
  <enumValues>
    <name>Обработан</name>
  </enumValues>
  <enumValues>
    <name>Утерян</name>
  </enumValues>
</mdclass:Enum>

БИТУправление_медицинским_центром_демо/src/Documents/ЗаказВоВнешнююЛабораторию/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

Процедура ДвиженияПоРегиструЛабораторныеИсследования()
	
	НаборЗаписей = Движения.ЛабораторныеИсследования;
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	
	Если Не ПометкаУдаления
		Или Состояние = Перечисления.СостоянияЗаказовЛаборатории.Отправлен
		Или Состояние = Перечисления.СостоянияЗаказовЛаборатории.ПолученРезультат
		Или Состояние = Перечисления.СостоянияЗаказовЛаборатории.Обработан
	Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ИсследованияСрезПервых.ИД,
		               |	ИсследованияСрезПервых.КлиникаИсходная
		               |ИЗ
		               |	РегистрСведений.ЛабораторныеИсследования.СрезПервых КАК ИсследованияСрезПервых
		               |ГДЕ
		               |	ИсследованияСрезПервых.ИД В(&ИД)";
		
		Запрос.УстановитьПараметр("ИД", Исследования.ВыгрузитьКолонку("ИД"));
		ВыборкаИсходныеКлиники = Запрос.Выполнить().Выбрать();
		
		ИДОбработанных = Новый Массив;
		Для Каждого СтрокаИсследования Из Исследования Цикл
			Если ИДОбработанных.Найти(СтрокаИсследования.ИД) = Неопределено Тогда
				
				Движение = НаборЗаписей.Добавить();
				ЗаполнитьЗначенияСвойств(Движение, Ссылка);
				ЗаполнитьЗначенияСвойств(Движение, СтрокаИсследования);
				Движение.Период = Дата;
				Движение.ДатаНачала = Дата;
								
				Движение.Статус = Перечисления.СостоянияИсследований.Забран;
				Движение.Лаборатория = Лаборатория;
				Движение.Местонахождение = Лаборатория;
				Движение.Клиент = Клиент;
				
				ВыборкаИсходныеКлиники.Сбросить();
				Если ВыборкаИсходныеКлиники.НайтиСледующий(Новый Структура("ИД", СтрокаИсследования.ИД)) Тогда
					Движение.КлиникаИсходная = ВыборкаИсходныеКлиники.КлиникаИсходная;
				КонецЕсли;
				
				ИДОбработанных.Добавить(СтрокаИсследования.ИД);
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
	
	НаборЗаписей.Записать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	ДвиженияПоРегиструЛабораторныеИсследования();
	
КонецПроцедуры

#КонецОбласти
